// Практическое задание 💎
// Выведите в консоль, 
// сколько может зарабатывать вечерний уборщик, имея голос и педагогическое образование?


let a = 40000;
let b = 22000;
let c = a+b;
console.log("Зарплата общая " + c);
 

 //второе

//  Сложите слово 'Владивосток' и число 2000, а также добавьте между ними пробел, 
//  чтобы получилось название известной песни. 
//  Результат выведите в консоль.

let vladik = 2000;

console.log("Владивосток " + vladik);

// третье 

let messanger = 128;
let photo = 254;
let vk = 137;
let standUp = 201; 

let procrastination = (messanger + photo + vk + standUp)/60;

// alert("Русалка прокрастинировала " + procrastination + " часов");
console.log("Русалка прокрастинировала " + procrastination + " часов");

//четвертое 

console.log(2**5);

//five
console.log("Нужно бежать со всех ног, чтобы только оставаться на месте, а чтобы куда-то попасть, надо бежать как минимум вдвое быстрее!");


//six

const greetings = "Привет";
const name = "Кот";
console.log(greetings+", "+name);


//seventh

let time;
console.log(time);

time = 34;
console.log("Старт поездки. Осталось минут " + time);

time -= 15;
console.log('Немного сториз в соцсетях. Осталось минут: '+time)

time-=10;
console.log('Немного не новостей, но событий. Осталось минут: '+time);

time=0;
console.log('Вы приехали. Добро пожаловать в Москву');

//eighth
let fahrenheit = 451;
let celsius = (fahrenheit - 32) / 1.8;
console.log(`${fahrenheit} градуса по Фаренгейту - это ${celsius} градуса по Цельсию.`);

